 PROGRAM-ID. PART1 AS "day2.part1".

 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
 SELECT INPUT-FILE ASSIGN TO INPUT-FILENAME
 ORGANIZATION IS LINE SEQUENTIAL.

 DATA DIVISION.
 FILE SECTION.
 FD INPUT-FILE.
 01 INPUT-RECORD PIC X(1000).

 WORKING-STORAGE SECTION.
 01 INPUT-FILENAME PIC X(100).
 01 INPUT-USE-TEST PIC X.
 01 INPUT-DUMMY-PAUSE PIC X.
 01 EOF-FLAG PIC X VALUE 'N'.  
   88 END-OF-FILE VALUE 'Y'.
 01 FILE-STATUS PIC XX.
   88 FILE-OK VALUE '00'.
   88 FILE-NOT-FOUND VALUE '35'.
   
  01 SAMPLE-NAME VALUE 'SAMPLE.TXT'.
  01 REAL-NAME VALUE 'INPUT.TXT'.


 PROCEDURE DIVISION.
 MAIN-PARAGRAPH.
     DISPLAY "USE TEST CASE? (Y/N): ".
     ACCEPT INPUT-USE-TEST.

     IF INPUT-USE-TEST EQUAL TO "Y"
         MOVE SAMPLE-NAME TO INPUT-FILENAME
     ELSE
         MOVE REAL-NAME TO INPUT-FILENAME 
     END-IF.

     OPEN INPUT INPUT-FILE
     PERFORM READ-FILE-PARAGRAPH UNTIL END-OF-FILE
     CLOSE INPUT-FILE
     DISPLAY "PRESS ENTER TO CONTINUE..."
     ACCEPT INPUT-DUMMY-PAUSE.
     STOP RUN.


 READ-FILE-PARAGRAPH.
     READ INPUT-FILE
         AT END
             SET END-OF-FILE TO TRUE
         NOT AT END
             DISPLAY INPUT-RECORD
     END-READ.
 END PROGRAM PART1.